АлогистикТест2/src/Documents/алк_ЗагрузкаВСушильнуюКамеру/алк_ЗагрузкаВСушильнуюКамеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВСушильнуюКамеру</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПакетыВСушильныхКамерах</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_СушильныеКамеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидыОперацийПеремещениеЗапасов/алк_ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>ПередачаИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРасформированныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаУпаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственные</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеПакета</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСПереупаковки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСушку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушки</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВСушильнуюКамеру</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСушильнойКамеры</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВНезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушкиСырых</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_СГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_Магазин</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Ангар</name>
      <description>Ангар (сухие пиломатериалы)</description>
    </items>
    <items>
      <name>БуферСортировки</name>
      <description>Буфер сортировки</description>
    </items>
    <items>
      <name>ЖДтупик</name>
      <description>ЖД тупик</description>
    </items>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
    <items>
      <name>СушильныйБуфер</name>
      <description>Сушильный буфер</description>
    </items>
    <items>
      <name>УчастокГТО</name>
      <description>Участок ГТО</description>
    </items>
    <items>
      <name>ХолоднаяЗона</name>
      <description>Холодная зона (пересортировка)</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_ТипСклада</name>
    <type>
      <types>EnumRef.алк_ТипСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_УчетТоваровВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_УчетТоваровВПорту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_БалкПеревалка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ЗагрузкаВСушильнуюКамеру/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗагрузкаВСушильнуюКамеру, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();
		
		ДанныеДокументаЗагрузкВСушильнуюКамеру = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаЗагрузкаВСушильнуюКамеру, "Смена, Дата, СушильнаяКамера");
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗагрузкаВСушильнуюКамеру);
		Запрос.УстановитьПараметр("Период", ДанныеДокументаЗагрузкВСушильнуюКамеру.Дата);
		Запрос.УстановитьПараметр("Смена", ДанныеДокументаЗагрузкВСушильнуюКамеру.Смена);
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);  
		Запрос.УстановитьПараметр("ОперацияЗагрузка", Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ЗагрузкаВСушильнуюКамеру);
		Запрос.УстановитьПараметр("ЯчейкаЗагрузки", ПолучитьЯчейкуПоКамере(ДанныеДокументаЗагрузкВСушильнуюКамеру.СушильнаяКамера));  
		Запрос.УстановитьПараметр("ШтабельЗагрузки", ПолучитьШтабельПоКамере(ДанныеДокументаЗагрузкВСушильнуюКамеру.СушильнаяКамера));
		
		//Дубоделов Э.А 13.02.2023
		//Параметр, отвечающий за формирование таблиц с движениями по алк_ПроизводствоОборот и алк_ОстаткиЗапасов
		ЗаписыватьДвиженияВНовыеРегистры = РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДанныеДокументаЗагрузкВСушильнуюКамеру.Дата);
		
		Запрос.УстановитьПараметр("ЗаписыватьДвиженияВНовыеРегистры", ЗаписыватьДвиженияВНовыеРегистры);
		//Дубоделов Э.А

		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("алк_ПакетыВСушильныхКамерах", 	МассивРезультатовЗапроса[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", 	МассивРезультатовЗапроса[2].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", 	МассивРезультатовЗапроса[3].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции",  МассивРезультатовЗапроса[4].Выгрузить());
		
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
		Если ЗаписыватьДвиженияВНовыеРегистры Тогда
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", 		МассивРезультатовЗапроса[5].Выгрузить());
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", 	МассивРезультатовЗапроса[6].Выгрузить());
		КонецЕсли;
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --
		
	КонецПроцедуры

	#КонецОбласти
		
	#Область СервисныеПроцедурыИФункции
	
	Функция ПолучитьШтабельПоКамере(СушильнаяКамера);
		
		Штабель = Справочники.алк_Штабели.НайтиПоНаименованию("Сушильная камера " + СушильнаяКамера); 
		
		Возврат Штабель;   
		
	КонецФункции
	
	
	Функция ПолучитьЯчейкуПоКамере(СушильнаяКамера)
		
		Если Не ЗначениеЗаполнено(СушильнаяКамера) Тогда			
			Возврат Справочники.Ячейки.ПустаяСсылка();			
		КонецЕсли; 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|ГДЕ
		|	Ячейки.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", "Сушильная камера " + СушильнаяКамера);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			НоваяЯчейка = Справочники.Ячейки.СоздатьЭлемент();
			НоваяЯчейка.Владелец = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031"); // Сушильный комплекс
			НоваяЯчейка.Наименование =  "Сушильная камера " + СушильнаяКамера;			
			НоваяЯчейка.Записать();
			
		    Возврат НоваяЯчейка.Ссылка;
			
		КонецЕсли; 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
				
	КонецФункции // ПолучитьЯчейкуПоКамере()
	 	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Ссылка.Организация,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Ссылка.СтруктурнаяЕдиница,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Номенклатура,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Характеристика,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Сертификат,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Количество,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Объем,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.СерийныйНомер,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Ссылка.СушильнаяКамера,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Ссылка.Участок
		|ПОМЕСТИТЬ ВТ_ТаблицаДвижений
		|ИЗ
		|	Документ.алк_ЗагрузкаВСушильнуюКамеру.Номенклатура КАК алк_ЗагрузкаВСушильнуюКамеруНоменклатура
		|ГДЕ
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СушильнаяКамера
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка) КАК Ячейка
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияПриход,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	&ЯчейкаЗагрузки
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Период,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	&Смена,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Организация,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.СтруктурнаяЕдиница,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Номенклатура,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Характеристика,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Сертификат,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Количество,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Объем,
		|	ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка) КАК Ячейка,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.СерийныйНомер,
		|	1 КАК КоличествоПакетов,
		|	&ОперацияЗагрузка КАК Операция
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ЗагрузкаВСушильнуюКамеруНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Период,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Период,
		|	&ВидДвиженияПриход,
		|	&Смена,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Организация,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.СтруктурнаяЕдиница,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Номенклатура,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Характеристика,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Сертификат,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Количество,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Объем,
		|	&ЯчейкаЗагрузки,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.СерийныйНомер,
		|	1,
		|	&ОперацияЗагрузка
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ЗагрузкаВСушильнуюКамеруНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Период,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Организация,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.СтруктурнаяЕдиница,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Номенклатура,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Характеристика,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Сертификат,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Количество,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Объем,
		|	&ЯчейкаЗагрузки КАК Ячейка,
		|	ИСТИНА КАК ЭтоСушильнаяКамера
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ЗагрузкаВСушильнуюКамеруНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период КАК Период,
		|	ВТ_ТаблицаДвижений.Организация КАК Организация,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	NULL КАК Штабель,
		|	ВТ_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаДвижений.Характеристика КАК Характеристика,
		|	ВТ_ТаблицаДвижений.Сертификат КАК Сертификат,
		|	ВТ_ТаблицаДвижений.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Объем КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДВиженияНакопления.Расход) КАК ВидДвижения
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период,
		|	ВТ_ТаблицаДвижений.Организация,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница,
		|	&ШтабельЗагрузки,
		|	ВТ_ТаблицаДвижений.Номенклатура,
		|	ВТ_ТаблицаДвижений.Характеристика,
		|	ВТ_ТаблицаДвижений.Сертификат,
		|	ВТ_ТаблицаДвижений.СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Объем,
		|	ЗНАЧЕНИЕ(ВидДВиженияНакопления.Приход)
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период КАК Период,
		|	NULL КАК Бригада,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано) КАК ВидДвиженияПроизводства,
		|	ВТ_ТаблицаДвижений.Период КАК ДатаСмены,
		|	ВТ_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка) КАК Операция,
		|	ВТ_ТаблицаДвижений.Организация КАК Организация,
		|	ВТ_ТаблицаДвижений.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Сертификат КАК Сертификат,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница КАК Склад,
		|	&Смена КАК Смена,
		|	ВТ_ТаблицаДвижений.Характеристика КАК Характеристика,
		|	ВТ_ТаблицаДвижений.Количество КАК Количество,
		|	ВТ_ТаблицаДвижений.Участок КАК Участок
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано),
		|	ВТ_ТаблицаДвижений.Период,
		|	ВТ_ТаблицаДвижений.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка),
		|	ВТ_ТаблицаДвижений.Организация,
		|	ВТ_ТаблицаДвижений.СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Сертификат,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница,
		|	&Смена,
		|	ВТ_ТаблицаДвижений.Характеристика,
		|	ВТ_ТаблицаДвижений.Количество,
		|	NULL
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РапортПоЗагрузкеВСушильнуюКамеру") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РапортПоЗагрузкеВСушильнуюКамеру", "Рапорт по загрузке в сушильную камеру.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РапортПоЗагрузкеВСушильнуюКамеру"));
			
		КонецЕсли;
		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "РапортПоЗагрузкеВСушильнуюКамеру";
		КомандаПечати.Представление = НСтр("ru = 'Рапорт по загрузке в сушильную камеру.'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		
	КонецПроцедуры
	
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "РапортПоЗагрузкеВСушильнуюКамеру" Тогда
				
				Сформировать_РапортПоЗагрузкеВСушильнуюКамеру(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	Функция Сформировать_РапортПоЗагрузкеВСушильнуюКамеру(ТабличныйДокумент, ТекущийДокумент)
		
		МакетРапорта = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ЗагрузкаВСушильнуюКамеру.РапортПоЗагрузкеВСушильнуюКамеру");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.СерийныйНомер,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Номенклатура,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Характеристика,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Сертификат,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Количество КАК Количество,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Объем КАК Объем,
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.НомерСтроки
		|ИЗ
		|	Документ.алк_ЗагрузкаВСушильнуюКамеру.Номенклатура КАК алк_ЗагрузкаВСушильнуюКамеруНоменклатура
		|ГДЕ
		|	алк_ЗагрузкаВСушильнуюКамеруНоменклатура.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Объем)
		|ПО
		|	ОБЩИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗагрузкаВСушильнуюКамеру.Номер,
		|	алк_ЗагрузкаВСушильнуюКамеру.Дата,
		|	алк_ЗагрузкаВСушильнуюКамеру.Смена,
		|	алк_ЗагрузкаВСушильнуюКамеру.Организация,
		|	алк_ЗагрузкаВСушильнуюКамеру.СтруктурнаяЕдиница,
		|	алк_ЗагрузкаВСушильнуюКамеру.Ответственный,
		|	алк_ЗагрузкаВСушильнуюКамеру.СушильнаяКамера.Код
		|ИЗ
		|	Документ.алк_ЗагрузкаВСушильнуюКамеру КАК алк_ЗагрузкаВСушильнуюКамеру
		|ГДЕ
		|	алк_ЗагрузкаВСушильнуюКамеру.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		ДанныеШапки = МассивРезультатовЗапроса[1].Выбрать();
		ДанныеТабличнойЧастиОбщиеИтоги = МассивРезультатовЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ОбластьМакета = МакетРапорта.ПолучитьОбласть("Заголовок");
		Если ДанныеШапки.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеШапки);
			ОбластьМакета.Параметры.СушильнаяКамера = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ДанныеШапки.СушильнаяКамераКод);
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = МакетРапорта.ПолучитьОбласть("Строка");
		ИтогоКоличество = 0;
		ИтогоОбъем 	 	= 0;
		Пока ДанныеТабличнойЧастиОбщиеИтоги.Следующий() Цикл
			
			ИтогоКоличество = ДанныеТабличнойЧастиОбщиеИтоги.Количество;
			ИтогоОбъем 	 	= ДанныеТабличнойЧастиОбщиеИтоги.Объем;
			
			ВыборкаДетальныеЗаписи = ДанныеТабличнойЧастиОбщиеИтоги.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаДетальныеЗаписи);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
		КонецЦикла;
		
		ОбластьМакета = МакетРапорта.ПолучитьОбласть("Итоги");
		ОбластьМакета.Параметры.Количество = ИтогоКоличество;
		ОбластьМакета.Параметры.Объем = ИтогоОбъем;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецФункции
	
	#КонецОбласти
	
	
#КонецЕсли
